---
kind: type
id: T:Autodesk.Revit.DB.UpdaterId
source: html/16a9604f-51bd-ce34-f145-17ae06b7c1cf.htm
---
# Autodesk.Revit.DB.UpdaterId

A unique identifier of an Updater

## Syntax (C#)
```csharp
public class UpdaterId : IDisposable
```

## Remarks
UpdaterID used as a key to register and unregister Updaters and UpdateTriggers in Revit application